import React from "react";
import FaqItem from "@components/FaqItem";

const Faq = () => {
  return (
    <div>
      <FaqItem
        title="ماهو واجهة برمجة التطبيقات (API)؟"
        description="تقنية واجهة برمجة التطبيقات (APIs) هي عبارة عن خدمة تسمح بالربط الإلكتروني مع أنظمة مختلفة بهدف تبادل البيانات، وتكمن قيمتها في تمكين المطورين من الوصول إلى مختلف البيانات بشكل لحظي للحصول على بيانات محدثة "
      />
      <FaqItem
        title="هل هناك منصة استعلام مباشر لخدمة iTech؟"
        description="تقنية واجهة برمجة التطبيقات (APIs) هي عبارة عن خدمة تسمح بالربط الإلكتروني مع أنظمة مختلفة بهدف تبادل البيانات، وتكمن قيمتها في تمكين المطورين من الوصول إلى مختلف البيانات بشكل لحظي للحصول على بيانات محدثة "
      />
      <FaqItem
        title="من هم المستفيدون من خدمة iTech؟"
        description="تقنية واجهة برمجة التطبيقات (APIs) هي عبارة عن خدمة تسمح بالربط الإلكتروني مع أنظمة مختلفة بهدف تبادل البيانات، وتكمن قيمتها في تمكين المطورين من الوصول إلى مختلف البيانات بشكل لحظي للحصول على بيانات محدثة "
      />
      <FaqItem
        title="كيف يتم تحديث بيانات المنتجات على خدمة iTech؟"
        description="تقنية واجهة برمجة التطبيقات (APIs) هي عبارة عن خدمة تسمح بالربط الإلكتروني مع أنظمة مختلفة بهدف تبادل البيانات، وتكمن قيمتها في تمكين المطورين من الوصول إلى مختلف البيانات بشكل لحظي للحصول على بيانات محدثة "
      />
      <FaqItem
        title="ماهو واجهة برمجة التطبيقات (API)؟"
        description="تقنية واجهة برمجة التطبيقات (APIs) هي عبارة عن خدمة تسمح بالربط الإلكتروني مع أنظمة مختلفة بهدف تبادل البيانات، وتكمن قيمتها في تمكين المطورين من الوصول إلى مختلف البيانات بشكل لحظي للحصول على بيانات محدثة "
      />
      <FaqItem
        title="من هم المستفيدون من خدمة iTech؟"
        description="تقنية واجهة برمجة التطبيقات (APIs) هي عبارة عن خدمة تسمح بالربط الإلكتروني مع أنظمة مختلفة بهدف تبادل البيانات، وتكمن قيمتها في تمكين المطورين من الوصول إلى مختلف البيانات بشكل لحظي للحصول على بيانات محدثة "
      />
    </div>
  );
};

export default Faq;
